app/controllers/posts_controller.rb

  def index
    #get posts of an author if an author_id is in params
    #ex: authors/:id/posts
    #params[author_id] is provided through nested route
    if params[:author_id]
      @posts = Author.find(params[:author_id]).posts
    #get all posts
    else
      @posts = Post.all
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts"